
import json


champions = { 'Top':
                  ['크산테','잭스' , '다리우스' , '아트록스' , '오로라' , '뽀삐' , '나르' , '우디르' ,
                   '갱플랭크','말파이트' , '요네' , '케넨' , '제이스' , '카시오페아' , '피오라' , '레넥톤' , '그라가스' , '문도박사'
                      , '리븐' , '워윅' , '이렐리아' , '자크' , '모데카이저' , '사일러스' , '올라프' , '쉔' , '라이즈' , '볼리베어' ,
                   '럼블' , '탐켄치' ,'티모' , '렝가' , '클레드' , '카밀' , '아칼리' ,'판테온' , '사이온' , '트린다미어' , '우르곳' ,'블라디미르' ,
                   '초가스' , '갈리오' '하이머딩거' , '세트' , '그웬' , '퀸' , '신지드' , '요릭' , '나서스' , '오른' , '코르키' , '케일' , '가렌' ,
                   '피들스틱' , '야스오' ,'트런들' , '스몰더' , '스웨인' , '마오카이' , '세주아니' , '오공' , '바루스' , '신 짜오' , '베인' , '그레이브즈' ],
              'Jungle' : [ '그레이브즈' , '엘리스' , '리신' , '니달리' , '비에고' , '카서스' , '스카너'  ,'샤코' ,'카직스' ,'뽀삐','탈리야','벨베스' ,'렉사이','녹턴','신 짜오','자크','릴리아', '킨드레드','누누와 윌럼프','워윅','이블린','아이번','탈론','자르반4세' ,'키아나','피들스틱','케인','헤카림','자이라','에코','우디르' ,'바이','다이애나','람머스' ,'그웬' ,'볼리베어' ,'브랜드' ,'사일러스' , '세주아니' , '제드' , '오공' ,'그라가스' ,'티모' , '브라이어' , '마이터 이' , '쉬바나' , '모르가나' , '판테온' , '렝가' , '아무무' ],
              'Mid': [ '사일러스' , '르블랑' , '흐웨이' , '백스' , '아리' , '제드' , '탈론'  , '오리아나'  ,'조이' ,'애니비아' ,'갈리오'  ,'코르키'  ,'자크'  ,'아칼리' ,'키아나'  ,'오로라'  ,'탈리야'  ,'요네' ,'레넥톤','리산드라','카시오페아','야스오','야스오','제라스','럭스','니코','다이애나','트위스티드 페이트','신드라','이렐리아','카타리나','빅토르','비에고','애니','라이즈','아크샨','누누와 윌럼프' ,'에코','말자하','아지르' ,'블라디미르' ,'아우렐리온 솔' ,'카사딘','제이스','판테온','베이가','스웨인','피즈','크산테','나피리','초가스','트리스타나','말파이트','스몰더' ],
              'ADC':['애쉬', '진','드레이븐','코르키','코그모','자야','직스','트리스타나','케이틀린','칼리스타','징크스','시비르','루시안','카이사','흐웨이','미스포츈','이즈리얼','세라핀','닐라','아펠리오스','제라','사미라','바루스','트위치','스몰더','베인','스웨인'],
              'Support':[ '렐','레오나','뽀삐','쓰레쉬','파이크','노틸러스','룰루','브라움','라칸','바드','르블랑','타릭','세라핀','럭스','알리스타','카르마','아무무','제라스','사일러스','세나','니코','자이라','탐 켄치','블리치크랭크','조이','카밀','갈리오','잔나','나미','벨코즈','브랜드','밀리오','판테온','쉔','소라카' ,'유미','샤코','흐웨이','마오카이','자크','모르가나','스웨인','질리언','레나타 글라스크','하이머 딩거','피들스틱','소나' ]
              } # 여기에 원하는 챔피언 추가 가능

with open("champions.json", "w") as json_file:
    json.dump(champions, json_file)

print("Data saved to data.json")